In [1]:
#importing packages
import pandas as pd
import matplotlib as plt 
%matplotlib inline

In [3]:
ms = pd.read_csv('data/microsoft.csv')

In [4]:
ms.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2014-12-31  46.730000  47.439999  46.450001  46.450001  42.848763  21552500
1  2015-01-02  46.660000  47.419998  46.540001  46.759998  43.134731  27913900
2  2015-01-05  46.369999  46.730000  46.250000  46.330002  42.738068  39673900
3  2015-01-06  46.380001  46.750000  45.540001  45.650002  42.110783  36447900
4  2015-01-07  45.980000  46.459999  45.490002  46.230000  42.645817  29114100

In [5]:
#Convert the 'Date' column to datetime format
ms['Date'] = pd.to_datetime(ms['Date'])

# Set the 'Date' column as the index
ms.set_index('Date', inplace=True)

In [6]:
ms.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2014-12-31  46.730000  47.439999  46.450001  46.450001  42.848763  21552500
2015-01-02  46.660000  47.419998  46.540001  46.759998  43.134731  27913900
2015-01-05  46.369999  46.730000  46.250000  46.330002  42.738068  39673900
2015-01-06  46.380001  46.750000  45.540001  45.650002  42.110783  36447900
2015-01-07  45.980000  46.459999  45.490002  46.230000  42.645817  29114100

In [7]:
print(ms.shape)

(780, 6)

In [8]:
#showing summary of statistics of Microsoft
ms.describe()

,Open,High,Low,Close,Adj Close,Volume
count,780.000000,780.000000,780.000000,780.000000,780.000000,7.800000e+02
mean,58.912308,59.372308,58.465000,58.945397,56.931553,2.978900e+07
std,12.852040,12.868060,12.802831,12.830350,13.670080,1.522319e+07
min,40.340000,40.740002,39.720001,40.290001,37.267815,7.425600e+06
25%,47.894998,48.295000,47.535001,47.974998,44.792073,2.096685e+07
50%,56.150002,56.640001,55.700001,56.209999,53.775458,2.623125e+07
75%,67.892500,68.174997,67.447500,67.740000,66.565508,3.408020e+07
max,95.139999,96.070000,93.720001,95.010002,94.565781,1.691640e+08

The above shows the statistics of the Microsoft data.